pfg() {
	printf '[38;2;%sm' "$1"
}
pbg() {
	printf '[48;2;%sm' "$1"
}

fgcolor="$(pfg '248;249;232')"
bordercolor="$(pfg '203;227;179')"
blackfg="$(pfg '23;28;31')"
hlcolor="${fgcolor}$(pbg '203;227;179')"

message=$(while read line; do
	printf "  ${fgcolor}%s[0m\n" "$line"
done <index.txt)

cat <<EOF >static/index.txt

[1m                                   ${hlcolor}robinwobin.dev[0m         [0m
${bordercolor}[1m╭────────────────────────────────────────────────────────────────────────────────╮[0m
${message}
${bordercolor}[1m╰────────────────────────────────────────────────────────────────────────────────╯[0m

EOF
